using System;

/*
 * 1.Напишите программу, вычисляющую среднее арифметическое двух чисел.
 * 2.Введите три числа и выведите на экран значение суммы и произведения этих чисел.
 * 3.Напишите простой конвертер валют (без возможности динаического выбора валют пользователем).
 * Валюты заданы хардкодом и не изменяются. Тип валют на выбор программиста.
 * 
 */
namespace Homework1
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
